Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2064DAG176.atdf
      <value-group caption="Interrupt Vector Shift bits" name="ADCCON1__IRQVS">
         <value caption="Shift x left 7 bit position" name="" value="0x7" />
         <value caption="Shift x left 6 bit position" name="" value="0x6" />
         <value caption="Shift x left 5 bit position" name="" value="0x5" />
         <value caption="Shift x left 4 bit position" name="" value="0x4" />
         <value caption="Shift x left 3 bit position" name="" value="0x3" />
         <value caption="Shift x left 2 bit position" name="" value="0x2" />
         <value caption="Shift x left 1 bit position" name="" value="0x1" />
         <value caption="Shift x left 0 bit position" name="" value="0x0" />
      </value-group>
      <value-group caption="Fast Synchronous Peripheral Clock to ADC Control Clock bit" name="ADCCON1__FSPBCLKEN">
         <value caption="Fast synchronous peripheral clock to ADC control clock is enabled" name="" value="0x1" />
         <value caption="Fast synchronous peripheral clock to ADC control clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Fast Synchronous System Clock to ADC Control Clock bit" name="ADCCON1__FSSCLKEN">
         <value caption="Fast synchronous system clock to ADC control clock is enabled" name="" value="0x1" />
         <value caption="Fast synchronous system clock to ADC control clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Capacitive Voltage Division Enable bit" name="ADCCON1__CVDEN">
         <value caption="CVD operation is enabled" name="" value="0x1" />
         <value caption="CVD operation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Input Charge Pump Enable bit - see datasheet" name="ADCCON1__AICPMPEN">
         <value caption="Analog input charge pump is enabled (default)" name="" value="0x1" />
         <value caption="Analog input charge pump is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="ADCCON1__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Module Enable bit" name="ADCCON1__ON">
         <value caption="ADC module is enabled" name="" value="0x1" />
         <value caption="ADC module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Trigger Source Select bits" name="ADCCON1__STRGSRC">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Resolution bits" name="ADCCON1__SELRES">
         <value caption="12 bits (default)" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Fractional Data Output Format bit" name="ADCCON1__FRACT">
         <value caption="Fractional" name="" value="0x1" />
         <value caption="Integer" name="" value="0x0" />
      </value-group>
      <value-group caption="Turbo Slave ADCx bits" name="ADCCON1__TRBSLV">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="ADC4 is selected as the Turbo Slave" name="" value="0x4" />
         <value caption="ADC3 is selected as the Turbo Slave" name="" value="0x3" />
         <value caption="ADC2 is selected as the Turbo Slave" name="" value="0x2" />
         <value caption="ADC1 is selected as the Turbo Slave" name="" value="0x1" />
         <value caption="ADC0 is selected as the Turbo Slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Turbo Master ADCx bits" name="ADCCON1__TRBMST">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="ADC4 is selected as the Turbo Master" name="" value="0x4" />
         <value caption="ADC3 is selected as the Turbo Master" name="" value="0x3" />
         <value caption="ADC2 is selected as the Turbo Master" name="" value="0x2" />
         <value caption="ADC1 is selected as the Turbo Master" name="" value="0x1" />
         <value caption="ADC0 is selected as the Turbo Master" name="" value="0x0" />
      </value-group>
      <value-group caption="Turbo Channel Error Status bit" name="ADCCON1__TRBERR">
         <value caption="An error occurred while setting the Turbo channel and Turbo channel function to be disabled regardless of the TRBEN bit being set to 1." name="" value="0x1" />
         <value caption="Turbo channel error did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Turbo Channel Enable bit" name="ADCCON1__TRBEN">
         <value caption="Enable the Turbo channel" name="" value="0x1" />
         <value caption="Disable the Turbo channel" name="" value="0x0" />
      </value-group>
