Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2064DAG176.atdf
         <register caption="" name="SBT8WR1" offset="0x10858" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT8WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT8WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT8WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT8WR1__GROUP3" />
         </register>
         <register caption="" name="SBT9WR0" offset="0x10C38" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT9WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT9WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT9WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT9WR0__GROUP3" />
         </register>
         <register caption="" name="SBT9WR1" offset="0x10C58" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT9WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT9WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT9WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT9WR1__GROUP3" />
         </register>
         <register caption="" name="SBT10WR0" offset="0x11038" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT10WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT10WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT10WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT10WR0__GROUP3" />
         </register>
         <register caption="" name="SBT10WR1" offset="0x11058" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT10WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT10WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT10WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT10WR1__GROUP3" />
         </register>
         <register caption="" name="SBT11WR0" offset="0x11438" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT11WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT11WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT11WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT11WR0__GROUP3" />
         </register>
         <register caption="" name="SBT11WR1" offset="0x11458" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT11WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT11WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT11WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT11WR1__GROUP3" />
         </register>
         <register caption="" name="SBT12WR0" offset="0x11838" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT12WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT12WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT12WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT12WR0__GROUP3" />
         </register>
         <register caption="" name="SBT13WR0" offset="0x20438" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT13WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT13WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT13WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT13WR0__GROUP3" />
         </register>
         <register caption="" name="SBT13WR1" offset="0x20458" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT13WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT13WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT13WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT13WR1__GROUP3" />
         </register>
