Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2064DAG176.atdf
      <value-group caption="Region Size bits" name="SBT4REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT4REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT4REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT4REG1__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT4REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT4REG2__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT4REG3__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT4REG3__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT4REG4__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT4REG4__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT5REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT5REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT5REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT5REG1__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT5REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT5REG2__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT5REG3__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT5REG3__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT5REG4__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT5REG4__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT6REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
